Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
"
            }
        }

      + ephemeral_storage {
          + size = 1024
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "174639321782338904" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747635364168457000" -> "1756282810874872000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sbeacon-backend-splitQuery"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-splitQuery"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.additional_json[0] will be created
  + resource "aws_iam_role_policy" "additional_json" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-splitQuery"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-splitQuery"
    }

  # module.sbeacon.module.lambda-splitQuery.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-splitQuery-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-splitQuery"
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Splits a dataset into smaller slices of VCFs and invokes performQuery on each."
      + filename                       = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
      + function_name                  = "sbeacon-backend-splitQuery"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PERFORM_QUERY_LAMBDA"    = "sbeacon-backend-performQuery"
              + "PERFORM_QUERY_TOPIC_ARN" = "arn:aws:sns:ap-southeast-3:496940679572:performQuery"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2383138088008575164" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747635363782829000" -> "1756282812344063000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/sbeacon-backend-submitDataset"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-submitDataset"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-submitDataset-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:UploadPart",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:CreateMultipartUpload",
                          + "s3:CompleteMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[1] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-submitDataset-1"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[2] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-submitDataset-2"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.additional_jsons[3] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-submitDataset-3"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-submitDataset-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-submitDataset"
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Creates or updates a dataset and triggers summariseVcf."
      + function_name                  = "sbeacon-backend-submitDataset"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1769
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "sbeacon-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ATHENA_ANALYSES_CACHE_TABLE"          = "sbeacon_analyses_cache"
              + "ATHENA_ANALYSES_TABLE"                = "sbeacon_analyses"
              + "ATHENA_BIOSAMPLES_CACHE_TABLE"        = "sbeacon_biosamples_cache"
              + "ATHENA_BIOSAMPLES_TABLE"              = "sbeacon_biosamples"
              + "ATHENA_DATASETS_CACHE_TABLE"          = "sbeacon_datasets_cache"
              + "ATHENA_DATASETS_TABLE"                = "sbeacon_datasets"
              + "ATHENA_INDIVIDUALS_CACHE_TABLE"       = "sbeacon_individuals_cache"
              + "ATHENA_INDIVIDUALS_TABLE"             = "sbeacon_individuals"
              + "ATHENA_METADATA_BUCKET"               = "gaspi-metadata20250519061956402900000002"
              + "ATHENA_METADATA_DATABASE"             = "sbeacon_metadata"
              + "ATHENA_RELATIONS_TABLE"               = "sbeacon_relations"
              + "ATHENA_RUNS_CACHE_TABLE"              = "sbeacon_runs_cache"
              + "ATHENA_RUNS_TABLE"                    = "sbeacon_runs"
              + "ATHENA_TERMS_CACHE_TABLE"             = "sbeacon_terms_cache"
              + "ATHENA_TERMS_INDEX_TABLE"             = "sbeacon_terms_index"
              + "ATHENA_TERMS_TABLE"                   = "sbeacon_terms"
              + "ATHENA_WORKGROUP"                     = "query_workgroup"
              + "BEACON_ALTERNATIVE_URL"               = "https://bioinformatics.csiro.au/"
              + "BEACON_API_VERSION"                   = "v2.0.0"
              + "BEACON_CREATE_DATETIME"               = "2018-11-26H00:00:00Z"
              + "BEACON_DEFAULT_GRANULARITY"           = "boolean"
              + "BEACON_DESCRIPTION"                   = "Serverless Beacon (sBeacon)"
              + "BEACON_DOCUMENTATION_URL"             = "https://github.com/EGA-archive/beacon2-ri-api"
              + "BEACON_ENVIRONMENT"                   = "dev"
              + "BEACON_HANDOVERS"                     = jsonencode([])
              + "BEACON_ID"                            = "au.csiro.sbeacon"
              + "BEACON_NAME"                          = "CSIRO Serverless Beacon"
              + "BEACON_ORG_ADDRESS"                   = "AEHRC, Westmead NSW, Australia"
              + "BEACON_ORG_CONTACT_URL"               = "https://bioinformatics.csiro.au/get-in-touch/"
              + "BEACON_ORG_DESCRIPTION"               = "CSIRO, Australia"
              + "BEACON_ORG_ID"                        = "CSIRO"
              + "BEACON_ORG_LOGO_URL"                  = "https://raw.githubusercontent.com/aehrc/terraform-aws-serverless-beacon/master/assets/logo-tile.png"
              + "BEACON_ORG_NAME"                      = "CSIRO"
              + "BEACON_ORG_WELCOME_URL"               = "https://bioinformatics.csiro.au/"
              + "BEACON_SERVICE_TYPE_ARTIFACT"         = "beacon"
              + "BEACON_SERVICE_TYPE_GROUP"            = "au.csiro"
              + "BEACON_SERVICE_TYPE_VERSION"          = "1.0"
              + "BEACON_UPDATE_DATETIME"               = "2023-03-16H00:00:00Z"
              + "BEACON_URI"                           = "https://beacon.csiro.au"
              + "BEACON_VERSION"                       = "v0.1.0"
              + "BEACON_WELCOME_URL"                   = "https://bioinformatics.csiro.au/"
              + "CONFIG_MAX_VARIANT_SEARCH_BASE_RANGE" = "5000"
              + "DYNAMO_ANSCESTORS_TABLE"              = "sbeacon-Anscestors"
              + "DYNAMO_DATAPORTAL_LOCKS_TABLE"        = "sbeacon-dataportal-mutex-locks"
              + "DYNAMO_DESCENDANTS_TABLE"             = "sbeacon-Descendants"
              + "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
              + "DYNAMO_ONTOLOGIES_TABLE"              = "sbeacon-Ontologies"
              + "DYNAMO_PROJECT_USERS_TABLE"           = "sbeacon-dataportal-project-users"
              + "DYNAMO_PROJECT_USERS_UID_INDEX"       = "uid-index"
              + "DYNAMO_QUOTA_USER_TABLE"              = "sbeacon-dataportal-users-quota"
              + "DYNAMO_USER_INFO_TABLE"               = "sbeacon-dataportal-users-info"
              + "HTS_S3_HOST"                          = "s3.ap-southeast-3.amazonaws.com"
              + "REGION"                               = "ap-southeast-3"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-updateFiles"
        name              = "/aws/lambda/sbeacon-backend-updateFiles"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon-backend-updateFiles"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy.additional_json[0] will be created
  + resource "aws_iam_role_policy" "additional_json" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-updateFiles"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "sbeacon-backend-updateFiles"
    }

  # module.sbeacon.module.lambda-updateFiles.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "sbeacon-backend-updateFiles-logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-updateFiles:*:*",
                          + "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/sbeacon-backend-updateFiles:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "sbeacon-backend-updateFiles"
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:7",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:8",
        ] -> (known after apply)
      ~ role                           = "arn:aws:iam::496940679572:role/sbeacon-backend-updateFiles" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6919528109421189341" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754463682457717000" -> "1756282812848011000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ code_sha256                 = "929FXvhJQqhfuGM+QNocAW7LWrSZNY3zKFMh1XdpYxk=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-06T07:06:52.238+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:7" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/9c4eefd3c8f31399290d73adea5fd54d76de4e190cb2e0f4ba5d12857cbe7479.zip" -> "builds/45826a1eace8b12fd4ee732dce033bcd0cdc3daf1c69f4703c7ce13b7e801e79.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 23600014 -> (known after apply)
      ~ version                     = "7" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/9c4eefd3c8f31399290d73adea5fd54d76de4e190cb2e0f4ba5d12857cbe7479.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "4483934478a783708f7691a424b17db9-5" -> (known after apply)
      ~ id                            = "builds/9c4eefd3c8f31399290d73adea5fd54d76de4e190cb2e0f4ba5d12857cbe7479.zip" -> (known after apply)
      ~ key                           = "builds/9c4eefd3c8f31399290d73adea5fd54d76de4e190cb2e0f4ba5d12857cbe7479.zip" -> "builds/45826a1eace8b12fd4ee732dce033bcd0cdc3daf1c69f4703c7ce13b7e801e79.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/9c4eefd3c8f31399290d73adea5fd54d76de4e190cb2e0f4ba5d12857cbe7479.zip" -> "builds/45826a1eace8b12fd4ee732dce033bcd0cdc3daf1c69f4703c7ce13b7e801e79.zip"
      - tags                          = {
          - "Environment" = "dev"
        } -> null
      ~ tags_all                      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/45826a1eace8b12fd4ee732dce033bcd0cdc3daf1c69f4703c7ce13b7e801e79.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/45826a1eace8b12fd4ee732dce033bcd0cdc3daf1c69f4703c7ce13b7e801e79.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1686098975409925394" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9c4eefd3c8f31399290d73adea5fd54d76de4e190cb2e0f4ba5d12857cbe7479.zip" -> "builds/45826a1eace8b12fd4ee732dce033bcd0cdc3daf1c69f4703c7ce13b7e801e79.zip"
          ~ "timestamp" = "1748827758998694800" -> "1756282816166310000"
        }
    }

  # module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:8" -> (known after apply)
      ~ code_sha256                 = "N+C3HElFe1exppSrj+236vEuqUofszX1Nj0qUuUL2kY=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-18T02:41:08.717+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:8" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/012aec9bdfea28a1467f983637305455a1dfbfef172fccd589fe4362cda237d5.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 39435 -> (known after apply)
      ~ version                     = "8" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers20250519061959773600000003/builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "d38c6ded85bda56d8a0a9636e24c4067" -> (known after apply)
      ~ id                            = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> (known after apply)
      ~ key                           = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/012aec9bdfea28a1467f983637305455a1dfbfef172fccd589fe4362cda237d5.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/012aec9bdfea28a1467f983637305455a1dfbfef172fccd589fe4362cda237d5.zip"
      - tags                          = {
          - "Environment" = "dev"
        } -> null
      ~ tags_all                      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/012aec9bdfea28a1467f983637305455a1dfbfef172fccd589fe4362cda237d5.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/012aec9bdfea28a1467f983637305455a1dfbfef172fccd589fe4362cda237d5.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2932615389008481491" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/60860b433c625a698dbae872d0f311b06bf12af21960fe780f7c9f43f8b92b52.zip" -> "builds/012aec9bdfea28a1467f983637305455a1dfbfef172fccd589fe4362cda237d5.zip"
          ~ "timestamp" = "1755484680771675200" -> "1756282812725438200"
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/security-sendSecurityAlert"
        name              = "/aws/lambda/security-sendSecurityAlert"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "security-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "security-sendSecurityAlert"
        name                  = "security-sendSecurityAlert"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "security-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "security-sendSecurityAlert"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "security-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GASPI_ADMIN_EMAIL" = "nick.edwards@csiro.au" -> "gxcgaspi@gmail.com"
              ~ "SES_SOURCE_EMAIL"  = "dian.larasaty@xapiens.id" -> "gxcgaspi@gmail.com"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3946459518724485515" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747635364422024000" -> "1756282809161035000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-dbsnp"
        name              = "/aws/lambda/pgxflow-backend-dbsnp"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-dbsnp"
        name                  = "pgxflow-backend-dbsnp"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8248347478249943735" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754463704309764000" -> "1756282813581173000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-gnomad"
        name              = "/aws/lambda/pgxflow-backend-gnomad"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-gnomad"
        name                  = "pgxflow-backend-gnomad"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3684661784699142994" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754463704298796800" -> "1756282813637868800"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-lookup"
        name              = "/aws/lambda/pgxflow-backend-lookup"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-lookup"
        name                  = "pgxflow-backend-lookup"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/baf61dbbce9059a23bb369b76fef8ca15c079cf8a89ada3be17eac131549a8e0.zip" -> "builds/9d93cb36098b8ab1f33c2cc823e8cb754c35ccd1661b9a99270938feb8f2b428.zip"
        id                             = "pgxflow-backend-lookup"
      ~ last_modified                  = "2025-08-06T07:36:05.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_lookup/lambda/lookup",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/9d93cb36098b8ab1f33c2cc823e8cb754c35ccd1661b9a99270938feb8f2b428.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9d93cb36098b8ab1f33c2cc823e8cb754c35ccd1661b9a99270938feb8f2b428.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1553395192211498555" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/baf61dbbce9059a23bb369b76fef8ca15c079cf8a89ada3be17eac131549a8e0.zip" -> "builds/9d93cb36098b8ab1f33c2cc823e8cb754c35ccd1661b9a99270938feb8f2b428.zip"
          ~ "timestamp" = "1754463704184474000" -> "1756282813636929000"
        }
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-lookup-updateReferenceFiles"
        name              = "/aws/lambda/pgxflow-backend-lookup-updateReferenceFiles"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-lookup-updateReferenceFiles"
        name                  = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-lookup-updateReferenceFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:10",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4025235514113887817" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1752551957267170000" -> "1756282813526759000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "98c9aa9b5263e539024d970ca7b7f5f5bd97ea96"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/pharmcat"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:65b66afb3655e79747168539fddc7afd0f0901d72cfc01bc040b1dce8f1dbb17" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      ~ sha256_digest        = "sha256:65b66afb3655e79747168539fddc7afd0f0901d72cfc01bc040b1dce8f1dbb17" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "85e121f306eda111a8d4eb92ef9738823a11057b" -> "98c9aa9b5263e539024d970ca7b7f5f5bd97ea96"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "67bea347ba6ce7ac10d27981d885cdaa77d2e967"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/pipeline_pharmcat/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/pipeline_pharmcat/lambda/preprocessor"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:6d046d594c32615ab6e569df15f4d88d37fc4bded392250772e6ee4ffe25ad0f" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      ~ sha256_digest        = "sha256:6d046d594c32615ab6e569df15f4d88d37fc4bded392250772e6ee4ffe25ad0f" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "b03aea785a2b18f16f0e182d1ba3d767cb848867" -> "67bea347ba6ce7ac10d27981d885cdaa77d2e967"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-pharmcat-gnomad"
        name              = "/aws/lambda/pgxflow-backend-pharmcat-gnomad"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-pharmcat-gnomad"
        name                  = "pgxflow-backend-pharmcat-gnomad"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat-gnomad"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-gnomad.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3647921858839642560" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1754463704609814800" -> "1756282810572346000"
            # (1 unchanged element hidden)
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-pharmcat"
        name              = "/aws/lambda/pgxflow-backend-pharmcat"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-pharmcat"
        name                  = "pgxflow-backend-pharmcat"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-pharmcat"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers@sha256:65b66afb3655e79747168539fddc7afd0f0901d72cfc01bc040b1dce8f1dbb17" -> (known after apply)
      ~ last_modified                  = "2025-08-06T07:19:27.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-postprocessor"
        name              = "/aws/lambda/pgxflow-backend-postprocessor"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-postprocessor"
        name                  = "pgxflow-backend-postprocessor"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/d48f624af3e8a8c1eb9fb124aca94f22a9beb8ec376ace1fa75d7655a557e7ec.zip" -> "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip"
        id                             = "pgxflow-backend-postprocessor"
      ~ last_modified                  = "2025-08-06T07:36:11.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:5",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:6",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/pipeline_pharmcat/lambda/postprocessor",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6689441087729880486" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d48f624af3e8a8c1eb9fb124aca94f22a9beb8ec376ace1fa75d7655a557e7ec.zip" -> "builds/8b6fc09523824b0961b9e45bdede7e982e366ee01d4331fd371a0d1e146d97c6.zip"
          ~ "timestamp" = "1754463704556113000" -> "1756282810562963000"
        }
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/pgxflow-backend-preprocessor"
        name              = "/aws/lambda/pgxflow-backend-preprocessor"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "pgxflow-backend-preprocessor"
        name                  = "pgxflow-backend-preprocessor"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "pgxflow-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambd
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.